Revit 2024 API
BalusterInfo Class
 The class represents an instance of a railing baluster or post.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public class BalusterInfo : IDisposable
Visual Basic
Public Class BalusterInfo _
	Implements IDisposable
Visual C++
public ref class BalusterInfo : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.BalusterInfo
See Also
BalusterInfo Members
Autodesk.Revit.DB.Architecture Namespace